def vzlom(A, B):
    Верхняя_строка = [1, 0, A]
    Нижняя_строка = [0, 1, B]
    print (f'\t{Верхняя_строка}')
    print (f'\t{Нижняя_строка}')
    while True:
        if (Верхняя_строка[2] == 1 and Нижняя_строка[2] == 0) or (Верхняя_строка[2] == 0 and Нижняя_строка[2] == 1):
            break            
        elif Верхняя_строка[2] < Нижняя_строка[2]:
            множитель = Нижняя_строка[2] // Верхняя_строка[2]
            for i in range (0, 3):
                Нижняя_строка[i] -= (Верхняя_строка[i]*множитель)
        else:
            множитель = Верхняя_строка[2] // Нижняя_строка[2]
            for i in range (0, 3):
                Верхняя_строка[i] -= (Нижняя_строка[i]*множитель)
        print ("")
        print (f'\t{Верхняя_строка}')
        print (f'\t{Нижняя_строка}')
    if Верхняя_строка[2] == 1:
        if Верхняя_строка[0] > 0:
            return Верхняя_строка[0]
        else:
            itog = Верхняя_строка[0]
            while itog < 0:
                itog += Нижняя_строка[0]
                print(f'\tК верхней прибавить нижнюю, чтобы положительные')
            return itog    
    elif Нижняя_строка[2] == 1:
        if Нижняя_строка[0] > 0:
            return Нижняя_строка[0]
        else:
            itog = Нижняя_строка[0]
            while itog < 0:
                itog += Верхняя_строка[0]
                print(f'\tК нижней прибавить верхнюю, чтобы положительные')
            return itog   

print(f'Расчёт значения методом Гаусса.')
print(f'[1, 0, A]\n[0, 1, B]')
A = int(input('Введите число А: '))
B = int(input('Введите число B: '))
t = vzlom(A, B)
print(f'Результат: {t}')