# -*- coding: utf-8 -*-
betabet = "АБВГДЕЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯ_"
ShifrText = "ЦЮВ_ЩИЬРРЬАВФФХЮФУЬРОНФУЯЯБЯЬЬЭЮСЧПБОМЧЩЛПКЬЛ_ХЬСБЮЮЛЫЮРЫЬЭСВОЫГЛТРЧСНЮРЩУЬРЪ_ЧЛООЫЩЭЙПЫМШПЯЛДШБЮЬЬРШАЖЦЩЦШРЛЩНХФНЖГОЯБУЪРРЬФНАЦНМПЮСАНВЩЬПЩЛЫХЬЪРЪЯЛШЮФРОПУЛЦДРРЬЬСЛРБЯЬСАПЛКБЯЮНЬЦАОЭЩВУАЫФЧП_ЬЦЗЦЧУЕРЩЬПУЛШЮЮБУПЫЪЫЕЯОНШРШАЦЗФЫКРФНЦЦЩЖШЮЖНЮБЪХЭСЧЦПЗЮЬПНЮЬБРМЭЯСЬОБРЩУП_ЬЬАВЪНЭЯОООРШОЗЩЩОПСЛЫЮУЖЧПУФТПБОМЧЩЛЮРШПЬТЯЬНЯЯЛ_ХЬСБЮЮЯНЮТЖДЭЯЛШ_СЮШШЪЛЫХРЮЮХТЪРРЬЛЯЮТЧЛФЦЩЦОРОЯХЕЛ_ЮЮЦЬАВСЧПНЮЦЪЦЮОПЫМШПЧФРРПЛПХБСТРРЧЦЕЯШНЪРЧЦЕГЛКБЯЛПКЬЪНЭЦЫЮШУЖДЭЯЛЦПЭЩЬУЩАНЮТСЯЪГЬОЦЩООЫЯЛТЮРФХЮТЬУБЦЩЦОРЮУЫЦ_ЬЭСЛЩНТЪЧПЯЭЫЮУМ_ХЬЗЫКЪЛЮРШПЬТЯЬНБАСПЮУМЩПУФХШВМНЖСЭ_ЮРЭНВФЪЖХЮФУЬРФНТ_ЪЩЭЦЛЪЮФЛХРЮК_ЛРОЯХРОЮХЭКНЯЯЭЩХРЫЬЫГРЫОРФЩШРБУЫЛХНТЦВУ_РЦЬУХМНЦЦЛРПТЪЩЛИФЫАВОУПХЪЪЮУЛЦПЮМНЬЮЪСШЕЛЭ_ЦРЭ_ЩК_ШПАНВБЮОЭЯОЦЫЩЛ_ХЬСБЮЮЖНЫОРЦПБЮОЫЩЛТВЭМ_ЛРЦОЪРЧАЖИСНТЯЭЭЮЬЗХЮУМ_ЛБКНВЮФШРЬЗЫКЭФНЯАСЦЬГДУАВООЬЩЛКБЯПЬПБЬУФБЮРРРЭРОШФНЯЯЛЪХАСНБЯПЬПЫМШПВСЩХДЪЫПУЭУПИФЮХРФНЗЩЬУПУАЬФЩЧНТРЩОЗГЛФШШЩЙП_ЪМТЬКЩШБЗНЮБЪПКЦЛРКАМФХЮФМПАМХТЩООЫСЭЙПЯЭЬССКНЪГЧЙБГЬОПЯНЖХЮФМПВСЩХДЪЫЭЛХНМВФШХВЛОЫЦЦЯРЮРУ_РПЮХЪМЪПТСЩЫРЪЭ_ЦРУЫЦЩЫЮРЩУП_ЬУФУФТХЬЛСЫГЫИДРМТЬЩЩЦАВЬОБЩОЫКЕЛЦУАЛР_ЯРУП_ЯЯБМШЬЩБСШ_ЦЮО_МЫЬАВМРШВССЮУЪДХАСТЛЫЪЪЭЦЩОЯАФУЬРЫЬЪСЛМП_ФЕВРИ_ВРЦЫШФЯНАЯОЮХЭСЫЭСКНГЯЬЪРРЭРОШФНМЬСШБАЪЫЭСКНЯЯВ_РРЫЮЮЕЪТШВЛЭ_ЩШУ_ЮЪНБЯЮНЦЦЛЭВВЗНТРЩУЩРЮЬЦЦЛААВМЫРУЧЦТСЙ_АПЛЯТЯФНЯАМРШЬМНАЫЧОФЛООНВЭМПБОЬШРЪПКЗМЦП_ЪЯБЦЫУЭЮЪНЬСГЦЭСЛЯБСЩУБРВОАВЗЛПЗСЩЮУСДХБЮРРРЫЦАСЧНГАМЫЕГУЯЪЩХНРУФОБЯЬНШРЫЦАСЮУЫМЛОЭВЯОЭРРУПБСЫБНЦХН_СЮШРОНАУЪЦДРШУЬГМЮРЕЛЬЭРЬОАБЯФФСЧНЮРЮЬЬРЦОЪРЧЛФЩЛЬСЛВЫЮРЬУРФФЮВОЮНЭСЛЫЮУЯЛПВСВЭЯЧЬУЩЙНШРЫЮШУСЩП_ЬЦЬЦЬНЮВЩЬЗЦЩЦХРЦНЦЦЧУЧЮЪЧПХЪЮЮФСНТРРУТПЮЫРХБОБЯШНТЦЦУП_ЪЫРЗМЩВРРИЬПДЦХРРУЬЯЩЦЖЦЭШШРГАЬЮЖУП_ЬЦЬЩЮЦТЮЖУП_МЮЮУЖУПЬЪШЮЭЪ_ШУЖНТЯЭЭ_ЩЩЦЬСЧЦАМЛЫХРФЫРЗСНЪСЦНЦЦЧУЧЮЖУПЭЪЫАВЬИПЮЪНАРЮУЖЦЩЦХЭЛР_ЦШУЭЩЛЭ_ЯЦЩРХЖРРЬФЯЛРОЯХРЩЬТЛСНШРЩЬТЛСНЯГЮЦПУЛСЮАЪТРЕЛЫРЗМЩШРЭ__ЯФ_ЛРЦЮРБФРКЦЛХФСЩЦОРТУЫЦУЫЮХЪЮЮЧЩИДРОЬЪШМЩЮУЛ_РЭЛЭ_ЦРЩРФМЩЮБЗНТБСНСЯЧЙЗЦЛ_ЮУМЮЮУЛЦПГЭЩВФЛЭЮБЮУЯЦЩЫЮРОЬЪАЯСПЮЪРЮФЪНТЩРОПВЬОЭБЫЬ_ВМНАЬЪФШЬМЯЛРЭРЮПЛШВЬЗ_ВАМНЯАСХ_ЦЩЦХРЭЪХЮФЩЮБЗНЯАФМБЩСЪПХМФХРЪТЮТЬУЭЩСЪПВЪНЖВЪН_СЩЙЗЦЛЯЖЩЮОЫЩЛФХЬСХЭЛШНЬЯЩЯБАЪЪПБЮОЫЯЛЪЮФЯДШЭЛЯ_ЦРЯБУЪЪП_СЮХУЪХЪЩЛЦПУЩЬТМЛЯЬЦЩОПЯНЖХБЮРХЮЩЬУЯЛРЮБЫЮШПЮЦОРЪ__СУЦЫСЭЙПУЛМЧЛЦУПЭЖНЭСВОЫЩЛЫРШЖРРВЗНХФЪНВУМФШВСЩЛЮЪНЦЦЧУЧЮЖЪПЫЪЫХЭ"

Y1 = []
Y2 = []
Y3 = []
Y4 = []
temp = ShifrText
while len(temp) > 0:
    for i in 1,2,3,4:
        Y1.append(temp[0])
        temp = temp [1:]
        try:
            Y2.append(temp[0])
        except(IndexError):
            break
        temp = temp [1:]
        try:
            Y3.append(temp[0])
        except(IndexError):
            break
        temp = temp [1:]
        try:
            Y4.append(temp[0])
        except(IndexError):
            break
        temp = temp [1:]        

Index1 = 0 
for i in betabet:
    Index1 += Y1.count(i)*(Y1.count(i)-1)
Index1 = Index1/(len(Y1)*(len(Y1)-1))

Index2 = 0 
for i in betabet:
    Index2 += Y2.count(i)*(Y2.count(i)-1)
Index2 = Index2/(len(Y2)*(len(Y2)-1))

Index3 = 0 
for i in betabet:
    Index3 += Y3.count(i)*(Y3.count(i)-1)
Index3 = Index3/(len(Y3)*(len(Y3)-1))

Index4 = 0 
for i in betabet:
    Index4 += Y4.count(i)*(Y4.count(i)-1)
Index4 = Index4/(len(Y4)*(len(Y4)-1))

print ("Индекс совпадения столбца 1: " + str(Index1))
print ("Индекс совпадения столбца 2: " + str(Index2))       
print ("Индекс совпадения столбца 3: " + str(Index3))
print ("Индекс совпадения столбца 4: " + str(Index4))
print ()

Vzaim_1_2 = 0
Vzaim_1_3 = 0
Vzaim_1_4 = 0

sdvig = 0
for i in range (0, 33):
    for i in range(0, len(betabet)):
        Vzaim_1_2 += Y1.count(betabet[i])*Y2.count(betabet[(i+sdvig)%33])
    Vzaim_1_2 = Vzaim_1_2/(len(Y1)*len(Y2))
    if Vzaim_1_2 > 0.053 and Vzaim_1_2 < 0.07:
        print ("Сдвиг 1-2 равен: " + str(33-sdvig))
        print ("Взаимный индекс совпадения 1,2: " + str(Vzaim_1_2))
    sdvig += 1

sdvig = 0
for i in range (0, 33):
    for i in range(0, len(betabet)):
        Vzaim_1_3 += Y1.count(betabet[i])*Y3.count(betabet[(i+sdvig)%33])
    Vzaim_1_3 = Vzaim_1_3/(len(Y1)*len(Y3))
    if Vzaim_1_3 > 0.053 and Vzaim_1_3 < 0.07:
        print ("Сдвиг 1-3 равен: " + str(33-sdvig))
        print ("Взаимный индекс совпадения 1,3: " + str(Vzaim_1_3))
    sdvig += 1

sdvig = 0
for i in range (0, 33):
    for i in range(0, len(betabet)):
        Vzaim_1_4 += Y1.count(betabet[i])*Y4.count(betabet[(i+sdvig)%33])
    Vzaim_1_4 = Vzaim_1_4/(len(Y1)*len(Y4))
    if Vzaim_1_4 > 0.053 and Vzaim_1_4 < 0.07:
        print ("Сдвиг 1-4 равен: " + str(33-sdvig))
        print ("Взаимный индекс совпадения 1,3: " + str(Vzaim_1_4))
    sdvig += 1    
    
